IDEA StatiCa Open Model
LoadingSLS Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Loading SLS
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Concrete.Load.LoadingSLS
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class LoadingSLS
Public Class LoadingSLS
public ref class LoadingSLS
The LoadingSLS type exposes the following members.
Constructors
Name | Description
LoadingSLS
 Constructor
Top
Properties
Name | Description
InternalForces
 Internal force in section (permanent for staged section)
InternalForcesImperfection
 Internal forces of imperfection effect
InternalForcesVariable
 Variable internal force in staged section only
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace